JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_i2c_driver.c
#include "stm32l47xxx_i2c_driver.h"


/*********************************************************************
 * @fn      		- I2C_PeriClockControl
 *
 * @brief           - Enables or disables the peripheral clock for the
 * 					  given I2C port
 *
 * @param[in]		- pI2Cx: Base address of the I2C peripheral (e.g., I2C1, I2C2)
 * @param[in]		- EnorDi: ENABLE or DISABLE macro
 *
 * @return			- none
 *
 * @note			- This function MUST be called to turn on the hardware
 * 					  clock in the RCC registers before trying to configure
 * 					  any I2C registers
 *********************************************************************/
void I2C_PeriClockControl(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	if (EnorDi == ENABLE)
	{
		if (pI2Cx == I2C1)
		{
			I2C1_PCLK_EN();
		}
		else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_EN();
		}
		else if (pI2Cx == I2C3)
		{
			I2C3_PCLK_EN();
		}
	}
	else
	{
		if (pI2Cx == I2C1)
		{
			I2C1_PCLK_DI();
		}
		else if (pI2Cx == I2C2)
		{
			I2C2_PCLK_DI();
		}
		else if (pI2Cx == I2C3)
		{
			I2C3_PCLK_DI();
		}
	}
}



/*********************************************************************
 * @fn      		- I2C_PeripheralControl
 *
 * @brief           - Enables or disables the given I2C peripheral by
 * setting or clearing the PE (Peripheral Enable) bit
 * in the CR1 register
 *
 * @param[in]		- pI2Cx: Base address of the I2C peripheral (e.g., I2C1)
 * @param[in]		- EnOrDi: ENABLE or DISABLE macro
 *
 * @return			- none
 *
 * @note			- The STM32L4 hardware requires the peripheral to be
 * DISABLED while configuring certain registers like
 * TIMINGR and OAR1. Enable it only when you are
 * ready to start communication.
 *********************************************************************/
void I2C_PeripheralControl(I2C_RegDef_t *pI2Cx, uint8_t EnOrDi)
{
	if (EnOrDi == ENABLE)
	{
		pI2Cx->CR1 |= (1 << I2C_CR1_PE);
	}
	else
	{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_PE);
	}
}



/*********************************************************************
 * @fn      		- I2C_Init
 *
 * @brief           - Initializes the I2C peripheral according to the
 * specified parameters in the user's handle structure
 *
 * @param[in]		- pI2CHandle: Pointer to the handle structure containing
 * the base address and configuration settings
 *
 * @return			- none
 *
 * @note			- The TIMINGR hex values used in this function assume
 * a default system clock (SYSCLK) of 16 MHz.
 *********************************************************************/
void I2C_Init(I2C_Handle_t *pI2CHandle)
{
	// 1. Enable the clock for the I2C peripheral first
	I2C_PeriClockControl(pI2CHandle->pI2Cx, ENABLE);

	// 2. Configure the Clock Speed (TIMINGR register)
	// Note: These hex values are pre-calculated by ST for a 16 MHz system clock.
	// If you ever change your main clock speed, these values will need to be recalculated
	if (pI2CHandle->I2C_Config.I2C_SCLSpeed == I2C_SCL_SPEED_SM)
	{
		pI2CHandle->pI2Cx->TIMINGR = 0x00404C74; // 100 kHz
	}
	else if (pI2CHandle->I2C_Config.I2C_SCLSpeed == I2C_SCL_SPEED_FM4K)
	{
		pI2CHandle->pI2Cx->TIMINGR = 0x0010020A; // 400 kHz
	}
	else if (pI2CHandle->I2C_Config.I2C_SCLSpeed == I2C_SCL_SPEED_FM2K)
	{
		pI2CHandle->pI2Cx->TIMINGR = 0x00200C28; // 200 kHz
	}
	else if (pI2CHandle->I2C_Config.I2C_SCLSpeed == I2C_SCL_SPEED_FM_PLUS)
	{
		pI2CHandle->pI2Cx->TIMINGR = 0x00000105; // 1 MHz
	}

	// 3. Configure the Device Own Address (OAR1 Register)
	uint32_t tempreg = 0;
	// The 7-bit address must be shifted left by 1 (it occupies bits 7:1)
	tempreg |= (pI2CHandle->I2C_Config.I2C_DeviceAddress << 1);

	// Enable the Own Address 1 by setting the OA1EN bit (Bit 15)
	tempreg |= (1 << I2C_OAR1_OA1EN);
	pI2CHandle->pI2Cx->OAR1 = tempreg;

	// 4. Configure the ACK control	(CR2 Register)
	// On STM32L4, hardware ACKs automatically by default
	// To DISABLE ACKs, we have to SET the NACK bit (Bit 15)
	if (pI2CHandle->I2C_Config.I2C_AckControl == I2C_ACK_ENABLE)
	{
		pI2CHandle->pI2Cx->CR2 &= ~(1 << I2C_CR2_NACK);	// Clear NACK bit (ACKs are sent normally)
	}
	else
	{
		pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_NACK);	// Set NACK bit (NACKs are sent instead)
	}
}



/*********************************************************************
 * @fn      		- I2C_DeInit
 *
 * @brief           - Resets the given I2C peripheral back to its
 * factory default state
 *
 * @param[in]		- pI2Cx: Base address of the I2C peripheral (e.g., I2C1)
 *
 * @return			- none
 *
 * @note			- This creates a hardware reset pulse using the RCC
 * APB1RSTR1 register (pressing and releasing the reset button).
 *********************************************************************/
void I2C_DeInit(I2C_RegDef_t *pI2Cx)
{
	if (pI2Cx == I2C1)
	{
		RCC->APB1RSTR1 |= (1 << 21);	// 1. Set the reset bit
		RCC->APB1RSTR1 &= ~(1 << 21);	// 2. Clear the reset bit to finish
	}
	else if (pI2Cx == I2C2)
	{
		RCC->APB1RSTR1 |= (1 << 22);	// It's like holding reset button
		RCC->APB1RSTR1 &= ~(1 << 22);	// It's like releasing that button, so everything is correctly reset
	}
	else if (pI2Cx == I2C3)
	{
		RCC->APB1RSTR1 |= (1 << 23);
		RCC->APB1RSTR1 &= ~(1 << 23);
	}
}



/*********************************************************************
 * @fn      		- I2C_MasterSendData
 *
 * @brief           - Transmits data as a Master device over the I2C bus
 * using a blocking (polling) method
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 * @param[in]		- pTxBuffer: Pointer to the buffer containing data to send
 * @param[in]		- Len: Number of bytes to transmit (Assumes <= 255)
 * @param[in]		- SlaveAddr: The 7-bit address of the target slave device
 *
 * @return			- none
 *
 * @note			- This uses the STM32 V2 hardware "flight plan" method
 * in the CR2 register. Address phase generation is automated
 *********************************************************************/
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t Len, uint8_t SlaveAddr)
{
	// The hardware NBYTES field is only 8 bits wide (Max 255).
	if (Len == 0 || Len > 255)
	{
		return; // Silently reject the invalid transfer
	}

	uint32_t tempreg = pI2CHandle->pI2Cx->CR2;

	// 1. Clear out the bits we are about to configure so we start fresh
	// Clear Slave Address (Bits 9:0), Number of Bytes (Bits 23:16), and RD_WRN bit (Bit 10)
	tempreg &= ~(0x3FF << I2C_CR2_SADD);	// 10 bits of ones
	tempreg &= ~(0xFF << I2C_CR2_NBYTES);
	tempreg &= ~(1 << I2C_CR2_RD_WRN);

	// 2. Set the Slave Address
	// The 7-bit address must be shifted left by 1 to sit in SADD[7:1]
	tempreg |= (SlaveAddr << 1) << I2C_CR2_SADD;	// Bit 0 is reserved Read/Write signal

	// 3. Set the Number of Bytes to transmit
	// Note: For this basic driver, we assume Len is 255 bytes or less
	tempreg |= (Len << I2C_CR2_NBYTES);

