JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_i2c_driver.c
	// 4. Request a WRITE operation (0 = Write, 1 = Read)
	// Since we cleared this bit above, it is already 0, but we can be explicit
	tempreg &= ~(1 << I2C_CR2_RD_WRN);

	// 5. Set the START bit to begin the communication
	tempreg |= (1 << I2C_CR2_START);

	// Write our "flight plan" back to the actual CR2 hardware register
	pI2CHandle->pI2Cx->CR2 = tempreg;

	// 6. Loop until all bytes are sent
	while (Len > 0)
	{
		// Wait until the TXIS (Transmit Interrupt Status) flag is set in ISR
		// TXIS means "The TXDR register is empty, give me the next byte!"
		while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TXIS));

		// Write data to the TXDR (Transmit Data Register)
		pI2CHandle->pI2Cx->TXDR = *pTxBuffer;

		// Move to the next byte in the buffer and decrease the length
		pTxBuffer++;
		Len--;
	}

	// 7. Wait for the TC (Transfer Complete) flag in ISR
	// TC means "I have successfully sent the exact NBYTES you told me to send"
	while(!I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TC));

	// 8. Generate the STOP condition to release the I2C bus
	pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_STOP);
}



/*********************************************************************
 * @fn      		- I2C_GetFlagStatus
 *
 * @brief           - Checks whether a specific I2C status flag is set
 * or reset in the Interrupt & Status Register (ISR)
 *
 * @param[in]		- pI2Cx: Base address of the I2C peripheral
 * @param[in]		- FlagName: Macro of the specific flag to check
 *
 * @return			- FLAG_SET (1) or FLAG_RESET (0)
 *
 * @note			- none
 *********************************************************************/
uint8_t I2C_GetFlagStatus(I2C_RegDef_t *pI2Cx, uint32_t FlagName)
{
	if (pI2Cx->ISR & FlagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}



/*********************************************************************
 * @fn      		- I2C_MasterReceiveData
 *
 * @brief           - Receives data as a Master device over the I2C bus
 * using a blocking (polling) method
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 * @param[in]		- pRxBuffer: Pointer to the buffer to store received data
 * @param[in]		- Len: Number of bytes to receive (Assumes <= 255)
 * @param[in]		- SlaveAddr: The 7-bit address of the target slave device
 *
 * @return			- none
 *
 * @note			- The V2 hardware automatically handles NACKing the
 * final byte based on the NBYTES configuration.
 *********************************************************************/
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr)
{
	// The hardware NBYTES field is only 8 bits wide (Max 255).
	// Advanced drivers use the RELOAD bit for >255, but we restrict it here.
	if (Len == 0 || Len > 255)
	{
		return; // Silently reject the invalid transfer
	}

	uint32_t tempreg = pI2CHandle->pI2Cx->CR2;

	// 1. Clear out the bits we're about to configure
	// Clear Slave Address (Bits 9:0), Number of Bytes (Bits 23:16), and RD_WRN bit (Bit 10)
	tempreg &= ~(0x3FF << I2C_CR2_SADD);
	tempreg &= ~(0xFF << I2C_CR2_NBYTES);
	tempreg &= ~(1 << I2C_CR2_RD_WRN);

	// 2. Set the Slave Address
	tempreg |= (SlaveAddr << 1) << I2C_CR2_SADD;

	// 3. Set the Number of Bytes to receive
	tempreg |= (Len << I2C_CR2_NBYTES);

	// 4. Request a READ operation (0 = Write, 1 = Read)
	// This is the main difference from the Send function
	tempreg |= (1 << I2C_CR2_RD_WRN);

	// 5. Set the START bit to begin the communication
	tempreg |= (1 << I2C_CR2_START);

	// Write our "flight plan" back to the hardware
	pI2CHandle->pI2Cx->CR2 = tempreg;

	// 6. Loop until all bytes are received
	while (Len > 0)
	{
		// Wait until the RXNE (Receive Data Register Not Empty) flag is set
		// RXNE means "I just got a byte from the sensor, come pick it up!"
		while (!I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_RXNE));

		// Read the data from the RXDR (Receive Data Register)
		// Doing this automatically clears the RXNE flag in the hardware
		*pRxBuffer = pI2CHandle->pI2Cx->RXDR;

		// Move to the next byte in the buffer
		pRxBuffer++;
		Len--;
	}

	// 7. Wait for the TC (Transfer Complete) flag
	// The hardware just automatically sent a NACK to the sensor
	while (!I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TC));

	// 8. Generate the STOP condition to release the I2C bus
	pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_STOP);
}



/*********************************************************************
 * @fn      		- I2C_MasterSendDataIT
 *
 * @brief           - Transmits data as a Master device over the I2C bus
 * using a non-blocking (interrupt) method
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 * @param[in]		- pTxBuffer: Pointer to the buffer containing data to send
 * @param[in]		- Len: Number of bytes to transmit
 * @param[in]		- SlaveAddr: The 7-bit address of the target slave device
 *
 * @return			- uint8_t: Returns the state of the driver (I2C_READY, I2C_BUSY_IN_TX)
 *
 * @note			- This function returns immediately. The actual transmission
 * happens in the background via interrupts.
 *********************************************************************/
uint8_t I2C_MasterSendDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint32_t Len, uint8_t SlaveAddr)
{
	uint8_t state = pI2CHandle->TxRxState;

	if (state == I2C_READY)
	{
		// 1. Save the variables into the handle so the ISR can find them later
		pI2CHandle->pTxBuffer = pTxBuffer;
		pI2CHandle->TxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
		pI2CHandle->DevAddr = SlaveAddr;

		// 2. Prepare the CR2 "Flight Plan" (Exactly like the polling function)
		uint32_t tempreg = pI2CHandle->pI2Cx->CR2;
		tempreg &= ~(0x3FF << I2C_CR2_SADD);
		tempreg &= ~(0xFF << I2C_CR2_NBYTES);
		tempreg &= ~(1 << I2C_CR2_RD_WRN);

		tempreg |= (SlaveAddr << 1) << I2C_CR2_SADD;
		tempreg |= (Len << I2C_CR2_NBYTES);
		tempreg |= (1 << I2C_CR2_START);
		pI2CHandle->pI2Cx->CR2 = tempreg;

		// 3. Enable the necessary Interrupts in CR1
		// TXIE: Triggers the ISR when TXIS goes HIGH (Ready for next byte)
		pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_TXIE);
		// TCIE: Triggers the ISR when TC goes HIGH (Transfer completely finished)
		pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_TCIE);
		// ERRIE: Triggers the ISR if an Error happens (BERR, ARLO, etc.)
		pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ERRIE);

		return 0; // Return 0 (SUCCESS - Job Accepted)
	}

	return 1; // Return 1 (BUSY - Job Rejected)
}



/*********************************************************************
 * @fn      		- I2C_MasterReceiveDataIT
 *
 * @brief           - Receives data as a Master device over the I2C bus
 * using a non-blocking (interrupt) method
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 * @param[in]		- pRxBuffer: Pointer to the buffer to store received data
 * @param[in]		- Len: Number of bytes to receive
 * @param[in]		- SlaveAddr: The 7-bit address of the target slave device
 *
 * @return			- uint8_t: Returns the state of the driver (I2C_READY, I2C_BUSY_IN_RX)
 *
 * @note			- This function returns immediately. The actual reception
 * happens in the background via interrupts.
 *********************************************************************/
uint8_t I2C_MasterReceiveDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint32_t Len, uint8_t SlaveAddr)
{
	uint8_t state = pI2CHandle->TxRxState;

	if (state == I2C_READY)
	{
		// 1. Save the variables into the handle
		pI2CHandle->pRxBuffer = pRxBuffer;
		pI2CHandle->RxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
		pI2CHandle->RxSize = Len;
		pI2CHandle->DevAddr = SlaveAddr;

		// 2. Prepare the CR2 "Flight Plan"
		uint32_t tempreg = pI2CHandle->pI2Cx->CR2;
		tempreg &= ~(0x3FF << I2C_CR2_SADD);
		tempreg &= ~(0xFF << I2C_CR2_NBYTES);
		tempreg &= ~(1 << I2C_CR2_RD_WRN);

		tempreg |= (SlaveAddr << 1) << I2C_CR2_SADD;
		tempreg |= (Len << I2C_CR2_NBYTES);
		tempreg |= (1 << I2C_CR2_RD_WRN); // Set to READ mode
		tempreg |= (1 << I2C_CR2_START);
		pI2CHandle->pI2Cx->CR2 = tempreg;

		// 3. Enable the necessary Interrupts in CR1
		// RXIE: Triggers the ISR when RXNE goes HIGH (Data is waiting to be read)
		pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_RXIE);
		// TCIE: Triggers the ISR when TC goes HIGH (Transfer completely finished)
		pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_TCIE);
		// ERRIE: Triggers the ISR if an Error happens
		pI2CHandle->pI2Cx->CR1 |= (1 << I2C_CR1_ERRIE);

		return 0; // Return 0 (SUCCESS - Job Accepted)
	}

	return 1; // Return 1 (BUSY - Job Rejected)
}



/*********************************************************************
 * @fn      		- I2C_EV_IRQHandling
 *
 * @brief           - Handles I2C event interrupts (TXIS, RXNE, TC)
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 *
 * @return			- none
 *
 * @note			- This function must be called from the I2Cx_EV_IRQHandler
 * in your main application.
 *********************************************************************/
void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle)
{
	// 1. Handle TXIS (Hardware wants the next byte to transmit)
	if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TXIS))
	{
		if (pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
		{
			if (pI2CHandle->TxLen > 0)
			{
				pI2CHandle->pI2Cx->TXDR = *(pI2CHandle->pTxBuffer);
				pI2CHandle->TxLen--;
				pI2CHandle->pTxBuffer++;
			}
		}
	}

	// 2. Handle RXNE (Hardware has a new byte ready to be read)
	else if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_RXNE))
	{
		if (pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
		{
			if (pI2CHandle->RxLen > 0)
			{
				*(pI2CHandle->pRxBuffer) = pI2CHandle->pI2Cx->RXDR;
				pI2CHandle->RxLen--;
				pI2CHandle->pRxBuffer++;
			}
		}
	}

