JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_i2c_driver.c
	// 3. Handle TC (Transfer Complete - The NBYTES flight plan is finished)
	else if (I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_FLAG_TC))
	{
		// Generate STOP condition if Repeated Start is disabled
		if (pI2CHandle->Sr == DISABLE)
		{
			pI2CHandle->pI2Cx->CR2 |= (1 << I2C_CR2_STOP);
		}

		// Save the state before we reset it so we know which callback to trigger
		uint8_t previousState = pI2CHandle->TxRxState;

		// Reset the handle state back to READY
		pI2CHandle->TxRxState = I2C_READY;

		// Turn off the interrupts
		pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_TXIE);
		pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_RXIE);
		pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_TCIE);

		// Notify the application
		if (previousState == I2C_BUSY_IN_TX)
		{
			I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_TX_CMPLT);
		}
		else if (previousState == I2C_BUSY_IN_RX)
		{
			I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_RX_CMPLT);
		}
	}
}



/*********************************************************************
 * @fn      		- I2C_ER_IRQHandling
 *
 * @brief           - Handles I2C error interrupts (BERR, ARLO, OVR)
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 *
 * @return			- none
 *
 * @note			- This function must be called from the I2Cx_ER_IRQHandler
 * in your main application. It automatically clears the errors.
 *********************************************************************/
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle)
{
	uint32_t isr_status = pI2CHandle->pI2Cx->ISR;

	// 1. Bus Error (BERR)
	if (isr_status & (1 << I2C_ISR_BERR))
	{
		// Clear the BERR flag by writing 1 to the ICR register
		pI2CHandle->pI2Cx->ICR |= (1 << I2C_ISR_BERR);

		// Notify the application that the bus crashed
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_BERR);
	}

	// 2. Arbitration Loss (ARLO)
	if (isr_status & (1 << I2C_ISR_ARLO))
	{
		// Clear the ARLO flag
		pI2CHandle->pI2Cx->ICR |= (1 << I2C_ISR_ARLO);

		// Notify the application
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_ARLO);
	}

	// 3. Overrun/Underrun (OVR)
	if (isr_status & (1 << I2C_ISR_OVR))
	{
		// Clear the OVR flag
		pI2CHandle->pI2Cx->ICR |= (1 << I2C_ISR_OVR);

		// Notify the app
		I2C_ApplicationEventCallback(pI2CHandle, I2C_ERROR_OVR);
	}
}



/*********************************************************************
 * @fn      		- I2C_IRQInterruptConfig
 *
 * @brief           - Configures the NVIC to enable or disable a specific IRQ
 *
 * @param[in]		- IRQNumber: The IRQ number to configure (e.g., IRQ_NO_I2C1_EV)
 * @param[in]		- EnorDi: ENABLE or DISABLE
 *
 * @return			- none
 *********************************************************************/
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	if (EnorDi == ENABLE)
	{
		if (IRQNumber <= 31)
		{
			// Program ISER0 register
			*NVIC_ISER0 |= (1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			// Program ISER1 register
			*NVIC_ISER1 |= (1 << (IRQNumber % 32));
		}
		else if (IRQNumber >= 64 && IRQNumber < 96)
		{
			// Program ISER2 register
			*NVIC_ISER2 |= (1 << (IRQNumber % 32));
		}
	}
	else
	{
		if (IRQNumber <= 31)
		{
			// Program ICER0 register
			*NVIC_ICER0 |= (1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			// Program ICER1 register
			*NVIC_ICER1 |= (1 << (IRQNumber % 32));
		}
		else if (IRQNumber >= 64 && IRQNumber < 96)
		{
			// Program ICER2 register
			*NVIC_ICER2 |= (1 << (IRQNumber % 32));
		}
	}
}



/*********************************************************************
 * @fn      		- I2C_IRQPriorityConfig
 *
 * @brief           - Configures the priority of a specific IRQ in the NVIC
 *
 * @param[in]		- IRQNumber: The IRQ number to configure
 * @param[in]		- IRQPriority: The priority level (0 to 15)
 *
 * @return			- none
 *********************************************************************/
void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	// 1. Find out which IPR register to use (IPR0 to IPR59)
	uint8_t iprx = IRQNumber / 4;

	// 2. Find out which section of the 32-bit register to use (0, 1, 2, or 3)
	uint8_t iprx_section = IRQNumber % 4;

	// 3. Calculate the shift amount. The lower 4 bits of each 8-bit section are not implemented in STM32
	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);

	// 4. Clear the 4 bits, then set the new priority
	*(NVIC_PR_BASE_ADDR + iprx) &= ~(0xF << shift_amount);
	*(NVIC_PR_BASE_ADDR + iprx) |= (IRQPriority << shift_amount);
}



/*********************************************************************
 * @fn      		- I2C_CloseSendData
 *
 * @brief           - Disables interrupt control bits and resets the handle state
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 *
 * @return			- none
 *********************************************************************/
void I2C_CloseSendData(I2C_Handle_t *pI2CHandle)
{
	// 1. Turn off the transmission and error interrupts
	pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_TXIE);
	pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_TCIE);
	pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_ERRIE);

	// 2. Unlock the driver so the application can try again
	pI2CHandle->TxRxState = I2C_READY;
}



/*********************************************************************
 * @fn      		- I2C_CloseReceiveData
 *
 * @brief           - Disables interrupt control bits and resets the handle state
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 *
 * @return			- none
 *********************************************************************/
void I2C_CloseReceiveData(I2C_Handle_t *pI2CHandle)
{
	// 1. Turn off the reception and error interrupts
	pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_RXIE);
	pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_TCIE);
	pI2CHandle->pI2Cx->CR1 &= ~(1 << I2C_CR1_ERRIE);

	// 2. Unlock the driver so the application can try again
	pI2CHandle->TxRxState = I2C_READY;
}



/*********************************************************************
 * @fn      		- I2C_SlaveSendData
 *
 * @brief           - Sends one byte of data when requested by the Master
 *
 * @param[in]		- pI2C: Base address of the I2C peripheral (e.g., I2C1)
 * @param[in]		- data: The 1-byte data to be transmitted
 *
 * @return			- none
 *
 * @note			- The slave does not generate the clock or manage the
 * transfer length. It just drops the byte into the TXDR.
 *********************************************************************/
void I2C_SlaveSendData(I2C_RegDef_t *pI2C, uint8_t data)
{
	// Drop the 1 byte of data directly into the Transmit Register
	pI2C->TXDR = data;
}



/*********************************************************************
 * @fn      		- I2C_SlaveReceiveData
 *
 * @brief           - Reads one byte of data sent by the Master
 *
 * @param[in]		- pI2C: Base address of the I2C peripheral (e.g., I2C1)
 *
 * @return			- uint8_t: The 1-byte data received from the Master
 *
 * @note			- none
 *********************************************************************/
uint8_t I2C_SlaveReceiveData(I2C_RegDef_t *pI2C)
{
	// Read the 1 byte of data directly from the Receive Register
	return (uint8_t)pI2C->RXDR;
}



/*********************************************************************
 * @fn      		- I2C_SlaveEnableDisableCallbackEvents
 *
 * @brief           - Enables or disables I2C interrupts for Slave mode
 *
 * @param[in]		- pI2Cx: Base address of the I2C peripheral
 * @param[in]		- EnorDi: ENABLE or DISABLE
 *
 * @return			- none
 *
 * @note			- STM32L4 (V2) uses CR1 for interrupt enables.
 *********************************************************************/
void I2C_SlaveEnableDisableCallbackEvents(I2C_RegDef_t *pI2Cx, uint8_t EnorDi)
{
	if (EnorDi == ENABLE)
	{
		pI2Cx->CR1 |= (1 << I2C_CR1_ADDRIE);
		pI2Cx->CR1 |= (1 << I2C_CR1_RXIE);
		pI2Cx->CR1 |= (1 << I2C_CR1_TXIE);
		pI2Cx->CR1 |= (1 << I2C_CR1_STOPIE);
		pI2Cx->CR1 |= (1 << I2C_CR1_ERRIE);
	}
	else
	{
		pI2Cx->CR1 &= ~(1 << I2C_CR1_ADDRIE);
		pI2Cx->CR1 &= ~(1 << I2C_CR1_RXIE);
		pI2Cx->CR1 &= ~(1 << I2C_CR1_TXIE);
		pI2Cx->CR1 &= ~(1 << I2C_CR1_STOPIE);
		pI2Cx->CR1 &= ~(1 << I2C_CR1_ERRIE);
	}
}



/*********************************************************************
 * @fn      		- I2C_ApplicationEventCallback
 *
 * @brief           - Application callback function to handle I2C events
 * and errors generated by the background interrupts
 *
 * @param[in]		- pI2CHandle: Pointer to the I2C handle structure
 * @param[in]		- AppEv: The application event macro (e.g., I2C_EV_TX_CMPLT)
 *
 * @return			- none
 *
 * @note			- This is a __weak implementation. The user application
 * should override this function in main.c to handle events.
 *********************************************************************/
__weak void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{
	// This is a weak implementation. The application may override this function.
	// We leave this completely empty on purpose!
}
